# Ablation +DCNv3: YOLOv8n + DCNv3 downsampling (no EMA, standard PAN-FPN head)
# Validates the contribution of deformable convolution alone.

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0  P1 (first Conv stays standard)
  - [-1, 1, DCNv3, [128, 3, 2]]     # 1  P2 — deformable downsampling
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, DCNv3, [256, 3, 2]]     # 3  P3 — deformable downsampling
  - [-1, 6, C2f, [256, True]]       # 4  <- P3 feature
  - [-1, 1, DCNv3, [512, 3, 2]]     # 5  P4 — deformable downsampling
  - [-1, 6, C2f, [512, True]]       # 6  <- P4 feature
  - [-1, 1, Conv, [1024, 3, 2]]     # 7  P5 (large stride, keep Conv)
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  <- P5 feature

head:
  # Standard PAN-FPN top-down path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11  cat P4
  - [-1, 3, C2f, [512]]                          # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14  cat P3
  - [-1, 3, C2f, [256]]                          # 15  detect-P3

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17  cat head-P4
  - [-1, 3, C2f, [512]]                          # 18  detect-P4
  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20  cat P5
  - [-1, 3, C2f, [1024]]                         # 21  detect-P5

  - [[15, 18, 21], 1, Detect, [nc]]              # 22
