# Ablation +BiFPN: YOLOv8n + BiFPN neck (Conv downsampling, no EMA)
# Validates the contribution of BiFPN feature fusion alone.

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0  P1
  - [-1, 1, Conv, [128, 3, 2]]      # 1  P2
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3  P3
  - [-1, 6, C2f, [256, True]]       # 4  <- P3 feature
  - [-1, 1, Conv, [512, 3, 2]]      # 5  P4
  - [-1, 6, C2f, [512, True]]       # 6  <- P4 feature
  - [-1, 1, Conv, [1024, 3, 2]]     # 7  P5
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  <- P5 feature

head:
  # BiFPN fusion on P3(4), P4(6), P5(9)
  - [[4, 6, 9], 1, BiFPN, [256, 512, 1024, 256]]  # 10
  - [-1, 1, Index, [0]]                             # 11  P3 fused
  - [-2, 1, Index, [1]]                             # 12  P4 fused
  - [-3, 1, Index, [2]]                             # 13  P5 fused

  - [-3, 1, C2f, [256]]                             # 14  detect-P3  (from layer 11)
  - [-2, 1, C2f, [256]]                             # 15  detect-P4  (from layer 12)
  - [-1, 1, C2f, [256]]                             # 16  detect-P5  (from layer 13)

  - [[-3, -2, -1], 1, Detect, [nc]]                 # 17
