# YOLOv8n with EMA + DCNv3 + Weighted feature fusion

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, DCNv3, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, EMA, [128]]
  - [-1, 1, DCNv3, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, EMA, [256]]
  - [-1, 1, DCNv3, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, EMA, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  # BiFPN-style bidirectional feature pyramid using standard ops
  # Lateral projections: reduce all scales to 256 channels
  - [12, 1, Conv, [256, 1, 1]]                        # 13: P5_lat
  - [9,  1, Conv, [256, 1, 1]]                        # 14: P4_lat
  - [6,  1, Conv, [256, 1, 1]]                        # 15: P3_lat

  # Top-down pathway: P5 → P4 → P3
  - [13, 1, nn.Upsample, [None, 2, 'nearest']]        # 16: P5_up
  - [[-1, 14], 1, Concat, [1]]                        # 17: concat(P5_up, P4_lat)
  - [-1, 1, Conv, [256, 3, 1]]                        # 18: P4_td

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 19: P4_td_up
  - [[-1, 15], 1, Concat, [1]]                        # 20: concat(P4_td_up, P3_lat)
  - [-1, 3, C2f, [256]]                               # 21: P3_out  ← detect P3

  # Bottom-up pathway: P3 → P4 → P5
  - [-1, 1, Conv, [256, 3, 2]]                        # 22: P3_down
  - [[-1, 18], 1, Concat, [1]]                        # 23: concat(P3_down, P4_td)
  - [-1, 3, C2f, [256]]                               # 24: P4_out  ← detect P4

  - [-1, 1, Conv, [256, 3, 2]]                        # 25: P4_down
  - [[-1, 13], 1, Concat, [1]]                        # 26: concat(P4_down, P5_lat)
  - [-1, 3, C2f, [256]]                               # 27: P5_out  ← detect P5

  - [[21, 24, 27], 1, Detect, [nc]]                   # 28
