# YOLOv8n with DCNv3 + BiFPN (no EMA)
# Ablation Plan B: removes EMA to test DCNv3+BiFPN combination

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0   P1
  - [-1, 1, DCNv3, [128, 3, 2]]      # 1   P2 -- depthwise sep downsampling
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, DCNv3, [256, 3, 2]]      # 3   P3 -- depthwise sep downsampling
  - [-1, 6, C2f, [256, True]]        # 4   <- P3 feature
  - [-1, 1, DCNv3, [512, 3, 2]]      # 5   P4 -- depthwise sep downsampling
  - [-1, 6, C2f, [512, True]]        # 6   <- P4 feature
  - [-1, 1, Conv, [1024, 3, 2]]      # 7   P5
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9   <- P5 feature

head:
  # Lateral projections: normalize all backbone scales to 1024 channels
  # (1024 * width=0.25 = 256 actual ch, matching backbone P5 capacity for fair comparison)
  # Using P5 capacity ensures the high-stride head (handling 87% of objects) is not bottlenecked
  - [9, 1, Conv, [1024, 1, 1]]                          # 10: P5_lat
  - [6, 1, Conv, [1024, 1, 1]]                          # 11: P4_lat
  - [4, 1, Conv, [1024, 1, 1]]                          # 12: P3_lat

  # Top-down pathway: P5 -> P4 -> P3
  - [10, 1, nn.Upsample, [None, 2, 'nearest']]          # 13: P5_up
  - [[-1, 11], 1, WeightedSum, [2]]                     # 14: a*P5_up + b*P4_lat  -> 256ch
  - [-1, 3, C2f, [1024]]                                # 15: P4_td

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]          # 16: P4_td_up
  - [[-1, 12], 1, WeightedSum, [2]]                     # 17: a*P4_td_up + b*P3_lat -> 256ch
  - [-1, 3, C2f, [1024]]                                # 18: P3_out <- detect P3

  # Bottom-up pathway: P3 -> P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]]                         # 19: P3_down
  - [[-1, 15], 1, WeightedSum, [2]]                     # 20: a*P3_down + b*P4_td  -> 256ch
  - [-1, 3, C2f, [1024]]                                # 21: P4_out <- detect P4

  - [-1, 1, Conv, [1024, 3, 2]]                         # 22: P4_down
  - [[-1, 10], 1, WeightedSum, [2]]                     # 23: a*P4_down + b*P5_lat -> 256ch
  - [-1, 3, C2f, [1024]]                                # 24: P5_out <- detect P5

  - [[18, 21, 24], 1, Detect, [nc]]                     # 25
