# Ablation +EMA: YOLOv8n + EMA attention (Conv downsampling, standard PAN-FPN head)
# Validates the contribution of EMA attention mechanism alone.

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0  P1
  - [-1, 1, Conv, [128, 3, 2]]      # 1  P2
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, EMA, [128]]             # 3  attention after P2 feature
  - [-1, 1, Conv, [256, 3, 2]]      # 4  P3
  - [-1, 6, C2f, [256, True]]       # 5
  - [-1, 1, EMA, [256]]             # 6  <- P3 feature with attention
  - [-1, 1, Conv, [512, 3, 2]]      # 7  P4
  - [-1, 6, C2f, [512, True]]       # 8
  - [-1, 1, EMA, [512]]             # 9  <- P4 feature with attention
  - [-1, 1, Conv, [1024, 3, 2]]     # 10 P5
  - [-1, 3, C2f, [1024, True]]      # 11
  - [-1, 1, SPPF, [1024, 5]]        # 12 <- P5 feature

head:
  # Standard PAN-FPN top-down path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 9], 1, Concat, [1]]                    # 14  cat P4
  - [-1, 3, C2f, [512]]                          # 15
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 6], 1, Concat, [1]]                    # 17  cat P3
  - [-1, 3, C2f, [256]]                          # 18  detect-P3

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 15], 1, Concat, [1]]                   # 20  cat head-P4
  - [-1, 3, C2f, [512]]                          # 21  detect-P4
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                   # 23  cat P5
  - [-1, 3, C2f, [1024]]                         # 24  detect-P5

  - [[18, 21, 24], 1, Detect, [nc]]              # 25
