# YOLOv8n with EMA + DCNv3 (real deformable) + BiFPN (WeightedSum fusion)
#
# Changes vs original:
#   - DCNv3 now uses torchvision.ops.deform_conv2d (real deformable conv)
#   - Head Concat replaced by WeightedSum for learnable bidirectional fusion

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0   P1 (first layer stays standard)
  - [-1, 1, DCNv3, [128, 3, 2]]      # 1   P2 -- deformable downsampling
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, EMA, [128]]              # 3   spatial attention after P2
  - [-1, 1, DCNv3, [256, 3, 2]]      # 4   P3 -- deformable downsampling
  - [-1, 6, C2f, [256, True]]        # 5
  - [-1, 1, EMA, [256]]              # 6   <- P3 feature with attention
  - [-1, 1, DCNv3, [512, 3, 2]]      # 7   P4 -- deformable downsampling
  - [-1, 6, C2f, [512, True]]        # 8
  - [-1, 1, EMA, [512]]              # 9   <- P4 feature with attention
  - [-1, 1, Conv, [1024, 3, 2]]      # 10  P5 (large stride, keep Conv)
  - [-1, 3, C2f, [1024, True]]       # 11
  - [-1, 1, SPPF, [1024, 5]]         # 12  <- P5 feature

head:
  # Lateral projections: normalize all backbone scales to 512 channels
  # (512 * width=0.25 = 128 actual ch, matching backbone P4 capacity for fairer comparison)
  - [12, 1, Conv, [512, 1, 1]]                          # 13: P5_lat
  - [9,  1, Conv, [512, 1, 1]]                          # 14: P4_lat
  - [6,  1, Conv, [512, 1, 1]]                          # 15: P3_lat

  # Top-down pathway: P5 -> P4 -> P3
  - [13, 1, nn.Upsample, [None, 2, 'nearest']]          # 16: P5_up
  - [[-1, 14], 1, WeightedSum, [2]]                     # 17: a*P5_up + b*P4_lat  -> 512ch
  - [-1, 3, C2f, [512]]                                 # 18: P4_td

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]          # 19: P4_td_up
  - [[-1, 15], 1, WeightedSum, [2]]                     # 20: a*P4_td_up + b*P3_lat -> 512ch
  - [-1, 3, C2f, [512]]                                 # 21: P3_out  <- detect P3

  # Bottom-up pathway: P3 -> P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                          # 22: P3_down
  - [[-1, 18], 1, WeightedSum, [2]]                     # 23: a*P3_down + b*P4_td  -> 512ch
  - [-1, 3, C2f, [512]]                                 # 24: P4_out  <- detect P4

  - [-1, 1, Conv, [512, 3, 2]]                          # 25: P4_down
  - [[-1, 13], 1, WeightedSum, [2]]                     # 26: a*P4_down + b*P5_lat -> 512ch
  - [-1, 3, C2f, [512]]                                 # 27: P5_out  <- detect P5

  - [[21, 24, 27], 1, Detect, [nc]]                     # 28
