# Ablation +BiFPN: YOLOv8n + BiFPN neck (Conv downsampling, no EMA)
# Validates the contribution of BiFPN feature fusion alone.

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0  P1
  - [-1, 1, Conv, [128, 3, 2]]      # 1  P2
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3  P3
  - [-1, 6, C2f, [256, True]]       # 4  <- P3 feature
  - [-1, 1, Conv, [512, 3, 2]]      # 5  P4
  - [-1, 6, C2f, [512, True]]       # 6  <- P4 feature
  - [-1, 1, Conv, [1024, 3, 2]]     # 7  P5
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  <- P5 feature

head:
  # BiFPN-style bidirectional feature pyramid using standard ops
  # Lateral projections
  - [9, 1, Conv, [256, 1, 1]]                        # 10: P5_lat
  - [6, 1, Conv, [256, 1, 1]]                        # 11: P4_lat
  - [4, 1, Conv, [256, 1, 1]]                        # 12: P3_lat

  # Top-down pathway: P5 → P4 → P3
  - [10, 1, nn.Upsample, [None, 2, 'nearest']]       # 13: P5_up
  - [[-1, 11], 1, Concat, [1]]                       # 14: concat(P5_up, P4_lat)
  - [-1, 1, Conv, [256, 3, 1]]                       # 15: P4_td

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       # 16: P4_td_up
  - [[-1, 12], 1, Concat, [1]]                       # 17: concat(P4_td_up, P3_lat)
  - [-1, 3, C2f, [256]]                              # 18: P3_out  ← detect P3

  # Bottom-up pathway: P3 → P4 → P5
  - [-1, 1, Conv, [256, 3, 2]]                       # 19: P3_down
  - [[-1, 15], 1, Concat, [1]]                       # 20: concat(P3_down, P4_td)
  - [-1, 3, C2f, [256]]                              # 21: P4_out  ← detect P4

  - [-1, 1, Conv, [256, 3, 2]]                       # 22: P4_down
  - [[-1, 10], 1, Concat, [1]]                       # 23: concat(P4_down, P5_lat)
  - [-1, 3, C2f, [256]]                              # 24: P5_out  ← detect P5

  - [[18, 21, 24], 1, Detect, [nc]]                  # 25
