# YOLOv8n with EMA + DCNv3 + Weighted feature fusion

nc: 102
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, DCNv3, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, EMA, [128]]
  - [-1, 1, DCNv3, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, EMA, [256]]
  - [-1, 1, DCNv3, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, EMA, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  # BiFPN fusion on P3(6), P4(9), P5(12)
  - [[6, 9, 12], 1, BiFPN, [256, 512, 1024, 256]]
  - [-1, 1, Index, [0]]
  - [-2, 1, Index, [1]]
  - [-3, 1, Index, [2]]
  - [-3, 1, C2f, [256]]
  - [-2, 1, C2f, [256]]
  - [-1, 1, C2f, [256]]
  - [[-3, -2, -1], 1, Detect, [nc]]
